Guivve-A/Car_control_esp32/src/main.cpp
#include <Arduino.h>
#include <BluetoothSerial.h>
// #include <Wire.h>
// #include <hd44780.h>
// #include <hd44780ioClass/hd44780_I2Cexp.h>
#include <ESP32Servo.h>

BluetoothSerial SerialBT;
// hd44780_I2Cexp lcd;
Servo servoBrazoIzq;
Servo servoBrazoDer;
Servo servoCabeza;

// ─── Enumeraciones ──────────────────────────────────────────

// enum class DisplayMode : uint8_t {
//   Standby,
//   Driving,
//   Mode1Input,
//   Mode2Telemetry
// };

// enum class TelemetryFocus : uint8_t {
//   None,
//   Hour,
//   Weather,
//   Name
// };

// Movimientos especiales (no bloqueantes)
enum class SpecialMove : uint8_t {
  None,
  Explore,   // X - movimiento aleatorio
  Dance,     // D - secuencia de baile
  Scan,      // V - escaneo 360 grados
  Prank      // P - susto (avance rapido + ojos)
};

// struct DebouncedButton {
//   uint8_t pin;
//   bool stableState;
//   bool lastReading;
//   unsigned long lastChangeAt;
// };

// Paso individual de una secuencia de movimiento especial
struct MoveStep {
  void (*action)();
  unsigned long durationMs;
};

// Estado de ejecucion de un movimiento especial
struct MoveState {
  SpecialMove activeMove = SpecialMove::None;
  const MoveStep* steps = nullptr;
  uint8_t totalSteps = 0;
  uint8_t currentStep = 0;
  unsigned long stepStartedAt = 0;
};

// ─── Pines ──────────────────────────────────────────────────

constexpr int ledPin = 23;
// constexpr int lcdColumns = 20;
// constexpr int lcdRows = 4;
// constexpr int i2cSdaPin = 21;
// constexpr int i2cSclPin = 22;

// constexpr int hourButtonPin = 25;
// constexpr int weatherButtonPin = 26;
// constexpr int nameButtonPin = 27;

// L298N
constexpr int pinIN1 = 4;
constexpr int pinIN2 = 18;
constexpr int pinIN3 = 21;
constexpr int pinIN4 = 22;

// Servos — GPIO25/26/27: pines limpios, sin funcion especial de boot
constexpr int servoBrazoIzqPin = 25;
constexpr int servoBrazoDerPin = 26;
constexpr int servoCabezaPin   = 27;

// ─── Constantes ─────────────────────────────────────────────

// Angulos de servos — ajustar segun montaje fisico
constexpr int brazoIzqReposo  =   0;
constexpr int brazoIzqActivo  =  90;
constexpr int brazoDerReposo  = 180;
constexpr int brazoDerActivo  =  90;
constexpr int cabezaIzqGrados =  45;
constexpr int cabezaCenGrados =  90;
constexpr int cabezaDerGrados = 135;

// constexpr unsigned long scrollIntervalMs = 220;
constexpr unsigned long commandIdleTimeoutMs = 120;
// constexpr unsigned long buttonDebounceMs = 35;
// constexpr unsigned long greetingRepeatGuardMs = 1500;
// constexpr uint8_t wallECharIndex = 0;
constexpr char bluetoothName[] = "Car-ESP32";

// ─── Iconos LCD ─────────────────────────────────────────────

// uint8_t wallEIcon[8] = {
//   B00000,
//   B01010,
//   B11111,
//   B01110,
//   B11111,
//   B10101,
//   B01110,
//   B00000
// };

// ─── Estado global ──────────────────────────────────────────

// DebouncedButton hourButton{hourButtonPin, HIGH, HIGH, 0};
// DebouncedButton weatherButton{weatherButtonPin, HIGH, HIGH, 0};
// DebouncedButton nameButton{nameButtonPin, HIGH, HIGH, 0};

String inputBuffer;
// String scrollMessage  = " ";
// String telemetryHour  = "--:--";
// String telemetryWeather = "Sin dato";
// String robotName      = "Wall-E";
// String greetingMessage = " ";

// DisplayMode currentMode = DisplayMode::Standby;
// TelemetryFocus currentTelemetryFocus = TelemetryFocus::None;
MoveState moveState;

bool brazosActivos = false;

unsigned long lastByteReceivedAt = 0;
// unsigned long lastScrollAt = 0;
// unsigned long lastGreetingSentAt = 0;
// int scrollOffset = 0;
// bool lcdReady = false;
// String lastGreetingPayload;

// ─── Prototipos ─────────────────────────────────────────────

void sendBluetoothLine(const String& message);
void moverAdelante();
void moverAtras();
void girarIzquierda();
void girarDerecha();
void detenerMotores();
void cancelSpecialMove();
void moverBrazos();
void cabezaIzquierda();
void cabezaCentro();
void cabezaDerecha();

// ═══════════════════════════════════════════════════════════
// LCD helpers — deshabilitado
// ═══════════════════════════════════════════════════════════

/*
String makeSpaces(size_t count) {
  String spaces;
  spaces.reserve(count);
  for (size_t i = 0; i < count; ++i) spaces += ' ';
  return spaces;
}

String fitLine(const String& value) {
  String result = value.substring(0, lcdColumns);
  while (result.length() < lcdColumns) result += ' ';
  return result;
}

char mapUtf8Pair(uint8_t firstByte, uint8_t secondByte) {
  if (firstByte == 0xC3) {
    switch (secondByte) {
      case 0x81: return 'A'; case 0x89: return 'E'; case 0x8D: return 'I';
      case 0x91: return 'N'; case 0x93: return 'O'; case 0x9A: return 'U';
      case 0x9C: return 'U'; case 0xA1: return 'a'; case 0xA9: return 'e';
      case 0xAD: return 'i'; case 0xB1: return 'n'; case 0xB3: return 'o';
      case 0xBA: return 'u'; case 0xBC: return 'u'; default: return '?';
    }
  }
  if (firstByte == 0xC2) {
    switch (secondByte) {
      case 0xA1: return '!'; case 0xBF: return '?'; default: return '?';
    }
  }
  return '?';
}

String sanitizeForLcd(const String& value) {
  String sanitized;
  sanitized.reserve(value.length());
  for (size_t i = 0; i < value.length(); ++i) {
    const uint8_t current = static_cast<uint8_t>(value[i]);
    if (current >= 32 && current <= 126) { sanitized += static_cast<char>(current); continue; }
    if (current == '\t' || current == '\n' || current == '\r') { sanitized += ' '; continue; }
    if (i + 1 < value.length()) {
      sanitized += mapUtf8Pair(current, static_cast<uint8_t>(value[i + 1]));
      ++i; continue;
    }
    sanitized += '?';
  }
  sanitized.trim();
  if (sanitized.length() == 0) sanitized = " ";
  if (sanitized.length() > 200) sanitized = sanitized.substring(0, 200);
  return sanitized;
}

void writeLine(int row, const String& text) {
  if (!lcdReady) return;
  lcd.setCursor(0, row);
  lcd.print(fitLine(text));
}

void clearScreen() {
  if (!lcdReady) return;
  for (int row = 0; row < lcdRows; ++row) writeLine(row, "");
}

void writeCenteredLine(int row, const String& text) {
  const String clipped = text.substring(0, lcdColumns);
  const int leftPadding = max(0, (lcdColumns - static_cast<int>(clipped.length())) / 2);
  writeLine(row, makeSpaces(leftPadding) + clipped);
}

void drawCenteredMessage(const String& message) {
  clearScreen();
  const String clean = sanitizeForLcd(message);
  if (clean.length() <= lcdColumns) { writeCenteredLine(1, clean); return; }
  int splitAt = clean.lastIndexOf(' ', lcdColumns);
  if (splitAt <= 0) splitAt = lcdColumns;
  String firstLine = clean.substring(0, splitAt);
  String secondLine = clean.substring(splitAt);
  firstLine.trim(); secondLine.trim();
  writeCenteredLine(1, firstLine);
  writeCenteredLine(2, secondLine);
}
*/

