Guivve-A/Car_control_esp32/src/main.cpp
// ═══════════════════════════════════════════════════════════
// Pantallas LCD por modo — deshabilitado
// ═══════════════════════════════════════════════════════════

/*
void drawStandbyScreen() {
  if (!lcdReady) return;
  clearScreen();
  writeCenteredLine(1, "Paga 0.50 ctvs");
  writeCenteredLine(2, "por un saludo");
}

void drawDrivingScreen() {
  if (!lcdReady) return;
  clearScreen();
  writeCenteredLine(1, "Modo Control");
  writeCenteredLine(2, "Listo...");
}

void drawTelemetryScreen() {
  drawCenteredMessage("Presiona un boton");
}

void drawSpecialMoveScreen(const String& moveName) {
  if (!lcdReady) return;
  clearScreen();
  writeCenteredLine(0, ">>> ESPECIAL <<<");
  writeCenteredLine(2, moveName);
}
*/

// ═══════════════════════════════════════════════════════════
// Mode1 scroll — deshabilitado
// ═══════════════════════════════════════════════════════════

/*
String buildMode1Frame() {
  const String track = makeSpaces(lcdColumns) + scrollMessage + makeSpaces(lcdColumns);
  if (scrollOffset > track.length() - lcdColumns) scrollOffset = 0;
  return track.substring(scrollOffset, scrollOffset + lcdColumns);
}

void refreshMode1Screen() {
  if (!lcdReady || currentMode != DisplayMode::Mode1Input) return;
  const String frame = buildMode1Frame();
  for (int row = 0; row < lcdRows; ++row) writeLine(row, frame);
}
*/

// ═══════════════════════════════════════════════════════════
// Gestion de modos — deshabilitado
// ═══════════════════════════════════════════════════════════

/*
void setMode(DisplayMode newMode) {
  currentMode = newMode;
  scrollOffset = 0;
  lastScrollAt = 0;
  if (currentMode != DisplayMode::Mode2Telemetry) currentTelemetryFocus = TelemetryFocus::None;
  if (!lcdReady) return;
  switch (currentMode) {
    case DisplayMode::Standby:       drawStandbyScreen(); break;
    case DisplayMode::Driving:       drawDrivingScreen(); break;
    case DisplayMode::Mode1Input:    clearScreen(); refreshMode1Screen(); break;
    case DisplayMode::Mode2Telemetry:
      currentTelemetryFocus = TelemetryFocus::None;
      drawTelemetryScreen();
      break;
  }
}

void setScrollMessage(const String& newMessage) {
  scrollMessage = sanitizeForLcd(newMessage);
  scrollOffset = 0;
  lastScrollAt = 0;
  if (currentMode == DisplayMode::Mode1Input) refreshMode1Screen();
}

void setGreetingMessage(const String& input) {
  String cleanedInput = input;
  cleanedInput.trim();
  if (cleanedInput.length() == 0) return;
  greetingMessage = sanitizeForLcd(cleanedInput);
  setScrollMessage(greetingMessage);
  const String greetingPayload = "TTS:" + greetingMessage;
  if (greetingPayload == lastGreetingPayload && millis() - lastGreetingSentAt < greetingRepeatGuardMs) return;
  lastGreetingPayload = greetingPayload;
  lastGreetingSentAt = millis();
  sendBluetoothLine(greetingPayload);
}

void renderTelemetryFocus() {
  if (currentMode != DisplayMode::Mode2Telemetry) return;
  switch (currentTelemetryFocus) {
    case TelemetryFocus::Hour:    drawCenteredMessage(telemetryHour);    return;
    case TelemetryFocus::Weather: drawCenteredMessage(telemetryWeather); return;
    case TelemetryFocus::Name:    drawCenteredMessage(robotName);        return;
    default:                      drawTelemetryScreen();                 return;
  }
}

void setTelemetryValue(TelemetryFocus field, const String& newValue) {
  const String sanitizedValue = sanitizeForLcd(newValue);
  if (field == TelemetryFocus::Hour)    telemetryHour    = sanitizedValue;
  if (field == TelemetryFocus::Weather) telemetryWeather = sanitizedValue;
  if (field == TelemetryFocus::Name)    robotName        = sanitizedValue;
  if (currentMode == DisplayMode::Mode2Telemetry && currentTelemetryFocus == field) renderTelemetryFocus();
}
*/

// ═══════════════════════════════════════════════════════════
// Funciones motoras basicas
// ═══════════════════════════════════════════════════════════

void moverAdelante() {
  digitalWrite(pinIN1, HIGH);
  digitalWrite(pinIN2, LOW);
  digitalWrite(pinIN3, HIGH);
  digitalWrite(pinIN4, LOW);
}

void moverAtras() {
  digitalWrite(pinIN1, LOW);
  digitalWrite(pinIN2, HIGH);
  digitalWrite(pinIN3, LOW);
  digitalWrite(pinIN4, HIGH);
}

void girarIzquierda() {
  digitalWrite(pinIN1, HIGH);
  digitalWrite(pinIN2, LOW);
  digitalWrite(pinIN3, LOW);
  digitalWrite(pinIN4, HIGH);
}

void girarDerecha() {
  digitalWrite(pinIN1, LOW);
  digitalWrite(pinIN2, HIGH);
  digitalWrite(pinIN3, HIGH);
  digitalWrite(pinIN4, LOW);
}

void detenerMotores() {
  digitalWrite(pinIN1, LOW);
  digitalWrite(pinIN2, LOW);
  digitalWrite(pinIN3, LOW);
  digitalWrite(pinIN4, LOW);
}

void encenderOjos() {
  digitalWrite(ledPin, HIGH);
}

void apagarOjos() {
  digitalWrite(ledPin, LOW);
}

// ═══════════════════════════════════════════════════════════
// Funciones de servomotores
// ═══════════════════════════════════════════════════════════

void moverBrazos() {
  brazosActivos = !brazosActivos;
  servoBrazoIzq.write(brazosActivos ? brazoIzqActivo : brazoIzqReposo);
  servoBrazoDer.write(brazosActivos ? brazoDerActivo : brazoDerReposo);
}

void cabezaIzquierda() { servoCabeza.write(cabezaIzqGrados); }
void cabezaCentro()    { servoCabeza.write(cabezaCenGrados); }
void cabezaDerecha()   { servoCabeza.write(cabezaDerGrados); }

// ═══════════════════════════════════════════════════════════
// Secuencias de movimientos especiales (tablas de pasos)
// ═══════════════════════════════════════════════════════════

// ── Bailar (Dance) ──────────────────────────────────────────
static const MoveStep danceSteps[] = {
  { moverAdelante,    300 },
  { girarIzquierda,   350 },
  { moverAdelante,    250 },
  { girarDerecha,     350 },
  { moverAtras,       300 },
  { girarDerecha,     400 },
  { moverAdelante,    200 },
  { girarIzquierda,   500 },
  { moverAtras,       250 },
  { girarDerecha,     500 },
  { moverAdelante,    300 },
  { girarIzquierda,   300 },
  { detenerMotores,     0 },
};
constexpr uint8_t danceStepCount = sizeof(danceSteps) / sizeof(danceSteps[0]);

