Guivve-A/Car_control_esp32/src/main.cpp
// ── Vigilar (Scan 360) ─────────────────────────────────────
static const MoveStep scanSteps[] = {
  { girarIzquierda,   400 },
  { detenerMotores,   800 },
  { girarIzquierda,   400 },
  { detenerMotores,   800 },
  { girarIzquierda,   400 },
  { detenerMotores,   800 },
  { girarIzquierda,   400 },
  { detenerMotores,   500 },
  { detenerMotores,     0 },
};
constexpr uint8_t scanStepCount = sizeof(scanSteps) / sizeof(scanSteps[0]);

// ── Susto (Prank) ──────────────────────────────────────────
static const MoveStep prankSteps[] = {
  { encenderOjos,     100 },
  { moverAdelante,    900 },
  { detenerMotores,   150 },
  { moverAtras,       150 },
  { detenerMotores,   600 },
  { apagarOjos,       200 },
  { detenerMotores,     0 },
};
constexpr uint8_t prankStepCount = sizeof(prankSteps) / sizeof(prankSteps[0]);

// ── Explorar (Explore) ─────────────────────────────────────
constexpr uint8_t exploreMaxSteps = 16;
static MoveStep exploreSteps[exploreMaxSteps];
static uint8_t exploreStepCount = 0;

void generateExploreSequence() {
  uint8_t idx = 0;
  int segments = random(4, 7);
  for (int seg = 0; seg < segments && idx < exploreMaxSteps - 1; ++seg) {
    exploreSteps[idx++] = { moverAdelante, (unsigned long)random(500, 1500) };
    if (idx < exploreMaxSteps - 1) {
      auto turnFn = random(0, 2) == 0 ? girarIzquierda : girarDerecha;
      exploreSteps[idx++] = { turnFn, (unsigned long)random(200, 600) };
    }
  }
  exploreSteps[idx++] = { detenerMotores, 0 };
  exploreStepCount = idx;
}

// ═══════════════════════════════════════════════════════════
// Maquina de estados para movimientos especiales
// ═══════════════════════════════════════════════════════════

void startSpecialMove(SpecialMove move) {
  cancelSpecialMove();

  moveState.activeMove = move;
  moveState.currentStep = 0;
  moveState.stepStartedAt = millis();

  switch (move) {
    case SpecialMove::Dance:
      moveState.steps = danceSteps;
      moveState.totalSteps = danceStepCount;
      // drawSpecialMoveScreen("Bailando!");
      sendBluetoothLine("MOVE:DANCE");
      break;

    case SpecialMove::Scan:
      moveState.steps = scanSteps;
      moveState.totalSteps = scanStepCount;
      // drawSpecialMoveScreen("Vigilando...");
      sendBluetoothLine("MOVE:SCAN");
      break;

    case SpecialMove::Prank:
      moveState.steps = prankSteps;
      moveState.totalSteps = prankStepCount;
      // drawSpecialMoveScreen("SUSTO!");
      sendBluetoothLine("MOVE:PRANK");
      break;

    case SpecialMove::Explore:
      generateExploreSequence();
      moveState.steps = exploreSteps;
      moveState.totalSteps = exploreStepCount;
      // drawSpecialMoveScreen("Explorando...");
      sendBluetoothLine("MOVE:EXPLORE");
      break;

    default:
      moveState.activeMove = SpecialMove::None;
      return;
  }

  if (moveState.totalSteps > 0) {
    moveState.steps[0].action();
  }

  Serial.print("Movimiento especial iniciado: ");
  Serial.println(static_cast<int>(move));
}

void cancelSpecialMove() {
  if (moveState.activeMove == SpecialMove::None) return;

  detenerMotores();

  if (moveState.activeMove == SpecialMove::Prank) {
    apagarOjos();
  }

  moveState.activeMove = SpecialMove::None;
  moveState.steps = nullptr;
  moveState.totalSteps = 0;
  moveState.currentStep = 0;

  sendBluetoothLine("MOVE:DONE");
  // setMode(currentMode);
}

void updateSpecialMove() {
  if (moveState.activeMove == SpecialMove::None) return;
  if (moveState.steps == nullptr) return;

  const MoveStep& step = moveState.steps[moveState.currentStep];

  if (step.durationMs == 0) {
    cancelSpecialMove();
    return;
  }

  if (millis() - moveState.stepStartedAt >= step.durationMs) {
    moveState.currentStep++;
    if (moveState.currentStep >= moveState.totalSteps) {
      cancelSpecialMove();
      return;
    }
    moveState.stepStartedAt = millis();
    moveState.steps[moveState.currentStep].action();
  }
}

bool isSpecialMoveActive() {
  return moveState.activeMove != SpecialMove::None;
}

// ═══════════════════════════════════════════════════════════
// Infraestructura BT
// ═══════════════════════════════════════════════════════════

/*
bool initLcd() {
  Wire.begin(i2cSdaPin, i2cSclPin);
  const int status = lcd.begin(lcdColumns, lcdRows);
  if (status != 0) {
    Serial.print("No se pudo inicializar el LCD. Codigo: ");
    Serial.println(status);
    return false;
  }
  lcd.clear();
  lcd.backlight();
  lcd.createChar(wallECharIndex, wallEIcon);
  return true;
}
*/

void sendBluetoothLine(const String& message) {
  SerialBT.println(message);
  Serial.println(message);
}

/*
bool wasButtonPressed(DebouncedButton& button) {
  const bool reading = digitalRead(button.pin);
  if (reading != button.lastReading) {
    button.lastReading = reading;
    button.lastChangeAt = millis();
  }
  if (millis() - button.lastChangeAt < buttonDebounceMs) return false;
  if (button.stableState != button.lastReading) {
    button.stableState = button.lastReading;
    if (button.stableState == LOW) return true;
  }
  return false;
}

void processTelemetryButtons() {
  if (currentMode != DisplayMode::Mode2Telemetry) return;
  if (wasButtonPressed(hourButton))    { currentTelemetryFocus = TelemetryFocus::Hour;    renderTelemetryFocus(); }
  if (wasButtonPressed(weatherButton)) { currentTelemetryFocus = TelemetryFocus::Weather; renderTelemetryFocus(); }
  if (wasButtonPressed(nameButton))    { currentTelemetryFocus = TelemetryFocus::Name;    renderTelemetryFocus(); }
}
*/

// ═══════════════════════════════════════════════════════════
// Procesamiento de comandos Bluetooth
// ═══════════════════════════════════════════════════════════

void handleCommand(String rawCommand) {
  rawCommand.trim();
  if (rawCommand.length() == 0) return;

  String upperCommand = rawCommand;
  upperCommand.toUpperCase();

  // ── Movimiento basico ─────────────────────────────────────
  if (upperCommand == "F") { cancelSpecialMove(); moverAdelante();   return; }
  if (upperCommand == "B") { cancelSpecialMove(); moverAtras();      return; }
  if (upperCommand == "L") { cancelSpecialMove(); girarIzquierda();  return; }
  if (upperCommand == "R") { cancelSpecialMove(); girarDerecha();    return; }
  if (upperCommand == "S") { cancelSpecialMove(); detenerMotores();  return; }
  if (upperCommand == "G") { cancelSpecialMove(); girarIzquierda(); delay(400); detenerMotores(); return; }
  if (upperCommand == "H") { cancelSpecialMove(); girarDerecha();   delay(400); detenerMotores(); return; }

  // ── Movimientos especiales ────────────────────────────────
  if (upperCommand == "X") { startSpecialMove(SpecialMove::Explore); return; }
  if (upperCommand == "D") { startSpecialMove(SpecialMove::Dance);   return; }
  if (upperCommand == "V") { startSpecialMove(SpecialMove::Scan);    return; }
  if (upperCommand == "P") { startSpecialMove(SpecialMove::Prank);   return; }

  // ── Modos de pantalla — deshabilitado ─────────────────────
  // if (upperCommand == "STANDBY") { setMode(DisplayMode::Standby);        return; }
  // if (upperCommand == "DRIVING")  { setMode(DisplayMode::Driving);        return; }
  // if (upperCommand == "MODE1")    { setMode(DisplayMode::Mode1Input);     return; }
  // if (upperCommand == "MODE2")    { setMode(DisplayMode::Mode2Telemetry); return; }

  // ── Control de ojos (LED) ─────────────────────────────────
  if (upperCommand == "ON")  { encenderOjos(); sendBluetoothLine("OK:ON");  return; }
  if (upperCommand == "OFF") { apagarOjos();   sendBluetoothLine("OK:OFF"); return; }

  // ── Mensajes / Saludos — deshabilitado ───────────────────
  // if (upperCommand.startsWith("SALUDO:"))   { setGreetingMessage(rawCommand.substring(7));  return; }
  // if (upperCommand.startsWith("GREETING:")) { setGreetingMessage(rawCommand.substring(9));  return; }
  // if (upperCommand.startsWith("TEXT:"))     { setGreetingMessage(rawCommand.substring(5));  return; }
  // if (upperCommand.startsWith("MSG:"))      { setGreetingMessage(rawCommand.substring(4));  return; }

  // ── Telemetria — deshabilitado ────────────────────────────
  // if (upperCommand.startsWith("SET_HORA:"))   { setTelemetryValue(TelemetryFocus::Hour,    rawCommand.substring(9));  return; }
  // if (upperCommand.startsWith("SET_TIEMPO:")) { setTelemetryValue(TelemetryFocus::Weather, rawCommand.substring(11)); return; }
  // if (upperCommand.startsWith("SET_NOMBRE:")) { setTelemetryValue(TelemetryFocus::Name,    rawCommand.substring(11)); return; }
  // if (upperCommand.startsWith("HORA:"))       { setTelemetryValue(TelemetryFocus::Hour,    rawCommand.substring(5));  return; }
  // if (upperCommand.startsWith("TIEMPO:"))     { setTelemetryValue(TelemetryFocus::Weather, rawCommand.substring(7));  return; }
  // if (upperCommand.startsWith("NOMBRE:"))     { setTelemetryValue(TelemetryFocus::Name,    rawCommand.substring(7));  return; }

  // ── Limpieza — deshabilitado ──────────────────────────────
  // if (upperCommand == "CLEAR") { setScrollMessage(" "); return; }

