Guivve-A/Car_control_esp32/src/main.cpp
  // ── Servos ────────────────────────────────────────────────
  if (upperCommand == "BRAZOS")     { moverBrazos();     return; }
  if (upperCommand == "CABEZA_IZQ") { cabezaIzquierda(); return; }
  if (upperCommand == "CABEZA_CEN") { cabezaCentro();    return; }
  if (upperCommand == "CABEZA_DER") { cabezaDerecha();   return; }

  Serial.print("Comando ignorado: ");
  Serial.println(rawCommand);
}

void readBluetoothCommands() {
  while (SerialBT.available()) {
    const char incoming = static_cast<char>(SerialBT.read());
    lastByteReceivedAt = millis();

    if (incoming == '\r') continue;

    if (incoming == '\n') {
      handleCommand(inputBuffer);
      inputBuffer = "";
      continue;
    }

    if (static_cast<uint8_t>(incoming) >= 32) {
      inputBuffer += incoming;
    }

    // Fast-path: caracteres individuales sin prefijo de comando largo.
    // NOTA: B no esta en fast-path (colisiona con BRAZOS).
    //       D no esta en fast-path (colisiona con DRIVING).
    //       S no esta en fast-path (colisiona con STANDBY/SET_*).
    //       G no esta en fast-path (colisiona con GREETING:).
    if (inputBuffer.length() == 1) {
      char c = inputBuffer[0];
      if (c == 'F' || c == 'L' || c == 'R' ||
          c == 'f' || c == 'l' || c == 'r' ||
          c == 'X' || c == 'x' ||
          c == 'V' || c == 'v' ||
          c == 'P' || c == 'p') {
        handleCommand(inputBuffer);
        inputBuffer = "";
        continue;
      }
    }

    if (inputBuffer.length() > 260) {
      inputBuffer = inputBuffer.substring(0, 260);
    }
  }

  if (inputBuffer.length() > 0 && millis() - lastByteReceivedAt >= commandIdleTimeoutMs) {
    handleCommand(inputBuffer);
    inputBuffer = "";
  }
}

// ═══════════════════════════════════════════════════════════
// Mode1 scroll — deshabilitado
// ═══════════════════════════════════════════════════════════

/*
void updateMode1Scroll() {
  if (currentMode != DisplayMode::Mode1Input || !lcdReady) return;
  if (millis() - lastScrollAt < scrollIntervalMs) return;
  lastScrollAt = millis();
  refreshMode1Screen();
  ++scrollOffset;
  const int maxOffset = scrollMessage.length() + lcdColumns;
  if (scrollOffset > maxOffset) scrollOffset = 0;
}
*/

// ═══════════════════════════════════════════════════════════
// Botones — deshabilitado
// ═══════════════════════════════════════════════════════════

/*
void setupButtons() {
  pinMode(hourButton.pin, INPUT_PULLUP);
  pinMode(weatherButton.pin, INPUT_PULLUP);
  pinMode(nameButton.pin, INPUT_PULLUP);
}
*/

// ═══════════════════════════════════════════════════════════
// Setup & Loop
// ═══════════════════════════════════════════════════════════

void setup() {
  pinMode(ledPin, OUTPUT);
  digitalWrite(ledPin, LOW);

  // Escribir LOW en el registro antes de activar el driver — elimina el transitorio de boot
  digitalWrite(pinIN1, LOW);
  digitalWrite(pinIN2, LOW);
  digitalWrite(pinIN3, LOW);
  digitalWrite(pinIN4, LOW);
  pinMode(pinIN1, OUTPUT);
  pinMode(pinIN2, OUTPUT);
  pinMode(pinIN3, OUTPUT);
  pinMode(pinIN4, OUTPUT);

  servoBrazoIzq.attach(servoBrazoIzqPin);
  servoBrazoDer.attach(servoBrazoDerPin);
  servoCabeza.attach(servoCabezaPin);
  servoBrazoIzq.write(brazoIzqReposo);
  servoBrazoDer.write(brazoDerReposo);
  servoCabeza.write(cabezaCenGrados);

  Serial.begin(115200);
  SerialBT.begin(bluetoothName);

  randomSeed(analogRead(0) ^ (millis() << 8));

  // setupButtons();
  // lcdReady = initLcd();
  // setMode(DisplayMode::Standby);

  Serial.println("Bluetooth listo. Comandos: F B L R S G H X D V P | ON OFF | BRAZOS CABEZA_IZQ CABEZA_CEN CABEZA_DER");
}

void loop() {
  readBluetoothCommands();
  // processTelemetryButtons();
  // updateMode1Scroll();
  updateSpecialMove();
}
